# Save Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintSetup..::..Save Method
PrintSetup Class See Also
---
Save the changes for the current print setting.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool Save()
```

Visual Basic
---
```text
Public Function Save As Boolean
```

Visual C++
---
```text
public:
bool Save()
```

# ### Return Value
False if save operation fails, otherwise True.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the current print setting is In-Session or the current print setting has not changed. |

# See Also
PrintSetup Class
Autodesk.Revit.DB Namespace